/*--------------------------------------------------------------*/
/* --- -----------------实验内容 -------------------------------*/
/* --- 1-了解STC-ISP工具生产延时函数方法 -----------------------*/
/* --- 2-掌握子函数的创建与调用---------------------------------*/
/* --- 实验平台：未来电子STC32核心板----------------------------*/
/* --- 视频学习：https://space.bilibili.com/494969171 ----------*/
/* --- QQ交流群：702805632 -------------------------------------*/
/* --- 参考资料：STC32实验室参考例程 ---------------------------*/
/*--------------------------------------------------------------*/
#include <STC32G.H>
#include "intrins.h"

#define MAIN_Fosc        24000000UL

void Delay1000ms();		//@24.000MHz


/*
 * Func: P2 light led点灯
 * Author: xycsee
 * Date: 2022.9.21
 */
void main()
{
	WTST = 0;  //设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
	EAXFR = 1; //扩展寄存器(XFR)访问使能
	CKCON = 0; //提高访问XRAM速度
	
	//核心板上LED连接的IO口为P5.3，当IO输出为高电平时，LED点亮
	P5M0 = 0x08;        //将P5.3口单独设置为推挽输出模式  0000 1000
	P5M1 = 0x00;
	
	P2M0 = 0x00;
	P2M1 = 0x00;
		
	while (1) {
		P2 = 0xff;
		Delay1000ms();     //实现效果：每隔1秒LED闪烁
		P2 = 0x00;
		Delay1000ms();     //实现效果：每隔1秒LED闪烁
	}
}

void Delay1000ms()		//@24.000MHz
{
	unsigned char i, j, k;
	_nop_();
	_nop_();
	i = 92;
	j = 50;
	k = 238;
	do {
		do {
			while (--k);
		} while (--j);
	} while (--i);
}
