#include "Motor.h"
#include "PWM.h"

//#define LF_A P02//左前电机A
//#define LF_B P03//左前电机B
//#define LB_A P01//左后电机A
//#define LB_B P00//左后电机B

//#define RF_A P05//右前电机A
//#define RF_B P04//右前电机B
//#define RB_A P06//右后电机A
//#define RB_B P07//右后电机B


unsigned char LF_A,LF_B,LB_A,LB_B,RF_A,RF_B,RB_A,RB_B;

/*******************************************************************************
* 函 数 名         : Motor_Stop()
* 函数功能		     : 小车停止函数
*******************************************************************************/
void Motor_Stop(void)
{
	 LF_A=0;  
	 LF_B=0;	 
	 LB_A=0;	 
	 LB_B=0;	 
	 RF_A=0;   
	 RF_B=0;	 
	 RB_A=0;	 
	 RB_B=0;	 
}

/*******************************************************************************
* 函 数 名         : Motor_Forward()
* 函数功能		     : 小车前进函数
*******************************************************************************/
void Motor_Forward(void)
{
	 LF_A=1;  
	 LF_B=0;	
	 LB_A=1;	 
	 LB_B=0;	
	
	 RF_A=1;   
	 RF_B=0;	 
	 RB_A=1;	 
	 RB_B=0;	 
}

/*******************************************************************************
* 函 数 名         : Motor_Back()
* 函数功能		     : 小车后退函数
*******************************************************************************/
void Motor_Back(void)
{
	 LF_A=0;  
	 LF_B=1;	
	 LB_A=0;	 
	 LB_B=1;		
	
	 RF_A=0;   
	 RF_B=1;	 
	 RB_A=0;	 
	 RB_B=1;	 
}

/*******************************************************************************
* 函 数 名         : Motor_Left()
* 函数功能		     : 小车左转函数
*******************************************************************************/
void Motor_Left(void)
{
	 LF_A=0;  
	 LF_B=1;	 
	 LB_A=0;	 
	 LB_B=1;
	
	 RF_A=1;   
	 RF_B=0;	 
	 RB_A=1;	 
	 RB_B=0;	 
}

/*******************************************************************************
* 函 数 名         : Motor_Right()
* 函数功能		     : 小车右转函数
*******************************************************************************/
void Motor_Right(void)
{
	 LF_A=1;  
	 LF_B=0;	 
	 LB_A=1;	 
	 LB_B=0;
	
	 RF_A=0;   
	 RF_B=1;	 
	 RB_A=0;	 
	 RB_B=1;	 
}
